# YOLOv11 with CBAM/ECA/CoordAtt applied on P3/P4/P5

nc: 80  # number of classes

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]             # 10

# YOLOv11 with only ECA (P4 branch)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 11
  - [[-1, 6], 1, Concat, [1]]                      # 12
  - [-1, 2, C3k2, [512, False]]                    # 13
  - [-1, 1, ECA, [None, 3]]                        # ✅ P4 注意力增强（ECA）

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 15
  - [[-1, 4], 1, Concat, [1]]                      # 16
  - [-1, 2, C3k2, [256, False]]                    # 17

  - [-1, 1, Conv, [256, 3, 2]]                     # 18
  - [[-1, 13], 1, Concat, [1]]                     # 19
  - [-1, 2, C3k2, [512, False]]                    # 20

  - [-1, 1, Conv, [512, 3, 2]]                     # 21
  - [[-1, 10], 1, Concat, [1]]                     # 22
  - [-1, 2, C3k2, [1024, True]]                    # 23

  - [[17, 20, 23], 1, Detect, [nc]]                # 24

